app/Http/Controllers/User/ApartmentController.php

select * from `apartments` where `user_id` = 61
---
    public function index()
    {
        // $duration = 144;
        // $exp_date = Carbon::now()->addHour($duration);
        // dd($exp_date);
        $userLogged = Auth::id();
        $apartments = Apartment::where('user_id', '=', $userLogged)->get();

select * from `services`
---
    public function create()
    {
        $services = Service::all();

insert into `apartments` (`title`, `description`, `rooms`, `beds`, `baths`, `mq`, `address`, `latitude`, `longitude`, `img_path`, `slug`, `user_id`, `updated_at`, `created_at`) values ('prova appartamento', 'appartamento di prova', '1', '1', '1', '50', 'Viale Borgo Valsugana 87, Prato, Toscana, Italia', '43.8764', '11.1144', 'images/8LXhs2k5VMLp5p9SYVlBfVUzi9B42WiRMkn1iIzp.jpeg', 'prova-appartamento-2020-06-24-09-35-56', 61, '2020-06-24 09:35:56', '2020-06-24 09:35:56')
---
        $apartment = new Apartment;
        $apartment->fill($data);

        $saved = $apartment->save();

insert into `apartment_service` (`apartment_id`, `service_id`) values (106, '1'), (106, '2')
---
        }

        if (isset($data['services'])) {
            $apartment->services()->attach($data['services']);

select * from `sponsorship_packs`
---
    public function show($id, Request $request)
    {
        $apartment = Apartment::findOrFail($id);
        $user_id = Auth::id();
        if ($user_id != $apartment->user_id) {
            abort('404');
        }

        $sponsorship_packs = Sponsorship_pack::all();

select * from `services`
---
    public function edit($id)
    {
        $apartment = Apartment::findOrFail($id);
        $services = Service::all();

update `apartments` set `slug` = 'prova-appartamento-2020-06-24-10-01-11', `apartments`.`updated_at` = '2020-06-24 10:01:11' where `id` = 106
---
        }

        $apartment->fill($data);
        $updated = $apartment->update();

select count(*) as aggregate from `messages` where `apartment_id` = '1'
---
    public function view_stats($id)
    {
        $apartment = Apartment::findOrFail($id);

        $messages_count = DB::table('messages')->where('apartment_id', '=', $id)->count();