app/Apartment.php

select `services`.*, `apartment_service`.`apartment_id` as `pivot_apartment_id`, `apartment_service`.`service_id` as `pivot_service_id` from `services` inner join `apartment_service` on `services`.`id` = `apartment_service`.`service_id` where `apartment_service`.`apartment_id` = 106
select * from `sponsorships` where `sponsorships`.`apartment_id` = 106 and `sponsorships`.`apartment_id` is not null
---
    public function toSearchableArray()
    {
        // $this->services;

        $array = $this->toArray();

        $array = $this->transform($array);

        // Creo il record _geoloc da inviare all'indice di Algolia.
        // Algolia ha bisogno che il record con lat e lng abbia questo nome
        // e come valore un oggetto di questo tipo: {lat: 11.111111, lng: 22.222222}
        // Qindi gli passo un array associativo che sarà convertito automaticamente
        $array['_geoloc'] = [
            'lat' => $array['latitude'],
            'lng' => $array['longitude']
        ];

        $array['services'] = $this->services->map(function($data) {
            return $data['id'];
        })->toArray();
        // $array['first_name'] = $this->user->first_name;
        // $array['sponsorship_'] = $this->author->email;

        $array['expiration_date'] = $this->sponsorships->map(function($data) {
            return $data['expiration_date'];
        })->toArray();