app/Http/Controllers/Guest/IndexController.php

select * from `services`
---
    public function index()
    {
        $services = Service::all();