app/Http/Controllers/Guest/SearchController.php

    public function index(Request $request)
    {
        $services = Service::all();
---
select * from `services`